IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_cm_udmaregs_regs.xml
<module id="UDMAREGS" HW_revision="" description="UDMAREGS Registers">
	<register id="DMASTAT" width="32" page="1" offset="0x0" internal="0" description="DMA Status">
		<bitfield id="MASTEN" description="Master Enable Status" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="STATE" description="Control State Machine Status" begin="7" end="4" width="4" rwaccess="R"/>
		<bitfield id="DMACHANS" description="Available DMA Channels Minus 1" begin="20" end="16" width="5" rwaccess="R"/>
	</register>
	<register id="DMACFG" width="32" page="1" offset="0x4" internal="0" description="DMA Configuration">
		<bitfield id="MASTEN" description="Controller Master Enable" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="DMACTLBASE" width="32" page="1" offset="0x8" internal="0" description="DMA Channel Control Base Pointer">
		<bitfield id="ADDR" description="Channel Control Base Address" begin="31" end="10" width="22" rwaccess="RW"/>
	</register>
	<register id="DMAALTBASE" width="32" page="1" offset="0xc" internal="0" description="DMA Alternate Channel Control Base Pointer">
		<bitfield id="ADDR" description="Alternate Channel Address Pointer" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="DMASWREQ" width="32" page="1" offset="0x14" internal="0" description="DMA Channel Software Request">
		<bitfield id="SWREQ" description="Channel [n] Software Request" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="DMAUSEBURSTSET" width="32" page="1" offset="0x18" internal="0" description="DMA Channel Useburst Set">
		<bitfield id="SET" description="Channel [n] Useburst Set" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="DMAUSEBURSTCLR" width="32" page="1" offset="0x1c" internal="0" description="DMA Channel Useburst Clear">
		<bitfield id="CLR" description="Channel [n] Useburst Clear" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="DMAREQMASKSET" width="32" page="1" offset="0x20" internal="0" description="DMA Channel Request Mask Set">
		<bitfield id="SET" description="Channel [n] Request Mask Set" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="DMAREQMASKCLR" width="32" page="1" offset="0x24" internal="0" description="DMA Channel Request Mask Clear">
		<bitfield id="CLR" description="Channel [n] Request Mask Clear" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="DMAENASET" width="32" page="1" offset="0x28" internal="0" description="DMA Channel Enable Set">
		<bitfield id="SET" description="Channel [n] Enable Set" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="DMAENACLR" width="32" page="1" offset="0x2c" internal="0" description="DMA Channel Enable Clear">
		<bitfield id="CLR" description="Clear Channel [n] Enable Clear" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="DMAALTSET" width="32" page="1" offset="0x30" internal="0" description="DMA Channel Primary Alternate Set">
		<bitfield id="SET" description="Channel [n] Alternate Set" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="DMAALTCLR" width="32" page="1" offset="0x34" internal="0" description="DMA Channel Primary Alternate Clear">
		<bitfield id="CLR" description="Channel [n] Alternate Clear" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="DMAPRIOSET" width="32" page="1" offset="0x38" internal="0" description="DMA Channel Priority Set">
		<bitfield id="SET" description="Channel [n] Priority Set" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="DMAPRIOCLR" width="32" page="1" offset="0x3c" internal="0" description="DMA Channel Priority Clear">
		<bitfield id="CLR" description="Channel [n] Priority Clear" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="DMAERRCLR" width="32" page="1" offset="0x4c" internal="0" description="DMA Bus Error Clear">
		<bitfield id="ERRCLR" description="DMA Bus Error Status" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="DMACHMAP0" width="32" page="1" offset="0x510" internal="0" description="DMA Channel Map Select 0">
		<bitfield id="CH0SEL" description="DMA Channel 0 Source Select" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="CH1SEL" description="DMA Channel 1 Source Select" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="CH2SEL" description="DMA Channel 2 Source Select" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="CH3SEL" description="DMA Channel 3 Source Select" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="CH4SEL" description="DMA Channel 4 Source Select" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="CH5SEL" description="DMA Channel 5 Source Select" begin="23" end="20" width="4" rwaccess="RW"/>
		<bitfield id="CH6SEL" description="DMA Channel 6 Source Select" begin="27" end="24" width="4" rwaccess="RW"/>
		<bitfield id="CH7SEL" description="DMA Channel 7 Source Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="DMACHMAP1" width="32" page="1" offset="0x514" internal="0" description="DMA Channel Map Select 1">
		<bitfield id="CH8SEL" description="DMA Channel 8 Source Select" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="CH9SEL" description="DMA Channel 9 Source Select" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="CH10SEL" description="DMA Channel 10 Source Select" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="CH11SEL" description="DMA Channel 11 Source Select" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="CH12SEL" description="DMA Channel 12 Source Select" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="CH13SEL" description="DMA Channel 13 Source Select" begin="23" end="20" width="4" rwaccess="RW"/>
		<bitfield id="CH14SEL" description="DMA Channel 14 Source Select" begin="27" end="24" width="4" rwaccess="RW"/>
		<bitfield id="CH15SEL" description="DMA Channel 15 Source Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="DMACHMAP2" width="32" page="1" offset="0x518" internal="0" description="DMA Channel Map Select 2">
		<bitfield id="CH16SEL" description="DMA Channel 16 Source Select" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="CH17SEL" description="DMA Channel 17 Source Select" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="CH18SEL" description="DMA Channel 18 Source Select" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="CH19SEL" description="DMA Channel 19 Source Select" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="CH20SEL" description="DMA Channel 20 Source Select" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="CH21SEL" description="DMA Channel 21 Source Select" begin="23" end="20" width="4" rwaccess="RW"/>
		<bitfield id="CH22SEL" description="DMA Channel 22 Source Select" begin="27" end="24" width="4" rwaccess="RW"/>
		<bitfield id="CH23SEL" description="DMA Channel 23 Source Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="DMACHMAP3" width="32" page="1" offset="0x51c" internal="0" description="DMA Channel Map Select 3">
		<bitfield id="CH24SEL" description="DMA Channel 24 Source Select" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="CH25SEL" description="DMA Channel 25 Source Select" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="CH26SEL" description="DMA Channel 26 Source Select" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="CH27SEL" description="DMA Channel 27 Source Select" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="CH28SEL" description="DMA Channel 28 Source Select" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="CH29SEL" description="DMA Channel 29 Source Select" begin="23" end="20" width="4" rwaccess="RW"/>
		<bitfield id="CH30SEL" description="DMA Channel 30 Source Select" begin="27" end="24" width="4" rwaccess="RW"/>
		<bitfield id="CH31SEL" description="DMA Channel 31 Source Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="DMAPeriphID4" width="32" page="1" offset="0xfd0" internal="0" description="DMA Peripheral Identification 4">
		<bitfield id="PID4" description="DMA Peripheral ID Register " begin="7" end="0" width="8" rwaccess="R"/>
	</register>
	<register id="DMAPeriphID0" width="32" page="1" offset="0xfe0" internal="0" description="DMA Peripheral Identification 0">
		<bitfield id="PID0" description="DMA Peripheral ID Register [7:0]" begin="7" end="0" width="8" rwaccess="R"/>
	</register>
	<register id="DMAPeriphID1" width="32" page="1" offset="0xfe4" internal="0" description="DMA Peripheral Identification 1">
		<bitfield id="PID1" description="DMA Peripheral ID Register [15:8]" begin="7" end="0" width="8" rwaccess="R"/>
	</register>
	<register id="DMAPeriphID2" width="32" page="1" offset="0xfe8" internal="0" description="DMA Peripheral Identification 2">
		<bitfield id="PID2" description="DMA Peripheral ID Register [23:16]" begin="7" end="0" width="8" rwaccess="R"/>
	</register>
	<register id="DMAPeriphID3" width="32" page="1" offset="0xfec" internal="0" description="DMA Peripheral Identification 3">
		<bitfield id="PID3" description="DMA Peripheral ID Register [31:24]" begin="7" end="0" width="8" rwaccess="R"/>
	</register>
	<register id="DMAPCellID0" width="32" page="1" offset="0xff0" internal="0" description="DMA PrimeCell Identification 0">
		<bitfield id="CID0" description="DMA PrimeCell ID Register [7:0]" begin="7" end="0" width="8" rwaccess="R"/>
	</register>
	<register id="DMAPCellID1" width="32" page="1" offset="0xff4" internal="0" description="DMA PrimeCell Identification 1">
		<bitfield id="CID1" description="DMA PrimeCell ID Register [15:8]" begin="7" end="0" width="8" rwaccess="R"/>
	</register>
	<register id="DMAPCellID2" width="32" page="1" offset="0xff8" internal="0" description="DMA PrimeCell Identification 2">
		<bitfield id="CID2" description="DMA PrimeCell ID Register [23:16]" begin="7" end="0" width="8" rwaccess="R"/>
	</register>
	<register id="DMAPCellID3" width="32" page="1" offset="0xffc" internal="0" description="DMA PrimeCell Identification 3">
		<bitfield id="CID3" description="DMA PrimeCell ID Register [31:24]" begin="7" end="0" width="8" rwaccess="R"/>
	</register>
</module>
